sjorge/illumos-omnios/usr/src/man/man1m/cdpadm.1m
'\" te
.\" Copyright 2015, 2018, 2019, Meisaka Yukara and Prominic.NET Inc., Rights
.\" Reserved.
.\" Copyright 2021 OmniOS Community Edition (OmniOSce) Association.
.\" The contents of this file are subject to the terms of the Common
.\" Development and Distribution License (the "License").  You may not use this
.\" file except in compliance with the License. .\" You can obtain a copy of the
.\" license at usr/src/OPENSOLARIS.LICENSE or
.\" http://www.opensolaris.org/os/licensing.  See the License for the specific
.\" language governing permissions and limitations under the License. .\" When
.\" distributing Covered Code, include this CDDL HEADER in each file and include
.\" the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the
.\" following below this CDDL HEADER, with the fields enclosed by brackets "[]"
.\" replaced with your own identifying information: Portions Copyright [yyyy]
.\" [name of copyright owner]
.Dd May 25, 2021
.Dt CDPADM 1M
.Os
.Sh NAME
.Nm cdpadm
.Nd administer the CDP service
.Sh SYNOPSIS
.Nm
.Op Fl f Ar format
.Ar subcommand
.Op Ar args
.Sh DESCRIPTION
The
.Nm
command is used to administer the
.Xr in.cdpd 1M
service.
.Ss Subcommands
.Bl -tag -width Ar
.It Cm show cdp Ns | Ns Cm nei
Outputs the current CDP neighbour table.
Supports output formats, see below.
.It Cm show detail
Outputs detailed information about each entry in the neighbour table.
.It Cm reap
Request that dead neighbours are removed from the neighbour table.
.It Cm stats
Display packet statistics.
.El
.Ss Output Formats
The
.Cm show
commands accept one of various output format specifiers.
A format specifier can appear anywhere in the arguments.
Multiple specifers can be included on the command line, but only the last one
will be used.
.Bl -tag -width Ar
.It Cm parse
Semicolon separated fields, no headers
.It Cm json
JSON style array of objects, one object per entry
.It Cm xml
XML formatted blocks
.El
.Sh FILES
.Bl -tag -width Ar
.It Pa /var/run/in.cdpd_socket
Socket used for communication with the CDP daemon.
.El
.Sh DIAGNOSTICS
.Bl -tag -width Ar
.It Sy The CDP service is not running.
The process failed to connect to the IPC socket, because it does not exist.
.Xr in.cdpd 1M
is most likely not running.
.El
.Sh SEE ALSO
.Xr in.cdpd 1M
